In [5]:
import pandas as pd 
import numpy as np

## The Pandas Series Object

In [2]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [3]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [4]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
data[1]

0.5

In [6]:
data[1:3]

1    0.50
2    0.75
dtype: float64

In [7]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [8]:
data['b']

0.5

In [9]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
 index=[2, 5, 3, 7])
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [10]:
data.sort_index(inplace=True)

In [11]:
data

2    0.25
3    0.75
5    0.50
7    1.00
dtype: float64

In [12]:
data[5]

0.5

In [13]:
population_dict = {'California': 38332521,
 'Texas': 26448193,
 'New York': 19651127,
 'Florida': 19552860,
 'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [14]:
population['California']

38332521

In [15]:
population['California':'Florida']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
dtype: int64

## Constructing Series objects

In [16]:
pd.Series([2, 4, 6])

0    2
1    4
2    6
dtype: int64

In [17]:
pd.Series(5,index=[2,3,4,5])

2    5
3    5
4    5
5    5
dtype: int64

In [18]:
pd.Series({2:'a',1:'b',3:'c'})

2    a
1    b
3    c
dtype: object

In [19]:
pd.Series({2:'a',1:'b',3:'c'}, index=[2,3])

2    a
3    c
dtype: object

## From a one-dimensional NumPy array.

In [20]:
pd.Series(np.arange(1,5),index=range(0,4))

0    1
1    2
2    3
3    4
dtype: int32

## The Pandas DataFrame Object

In [21]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
 'Florida': 170312, 'Illinois': 149995}

In [22]:
area=pd.Series(area_dict)

In [23]:
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [24]:
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

## From a dictionary of Series objects.

In [25]:
states=pd.DataFrame({'population':population,'area':area})

In [26]:
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [27]:
state=pd.DataFrame({'population':population,'area':area},columns=['population'])

In [28]:
state

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [29]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [30]:
states.columns

Index(['population', 'area'], dtype='object')

In [31]:
states.values

array([[38332521,   423967],
       [26448193,   695662],
       [19651127,   141297],
       [19552860,   170312],
       [12882135,   149995]], dtype=int64)

In [32]:
print(states['area'])
print(states['population'])

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
Name: population, dtype: int64

In [33]:
### for single series object

In [34]:
pd.DataFrame([population,area],columns=['population','area'])

   population  area
0         NaN   NaN
1         NaN   NaN

In [35]:
pd.DataFrame(population)

                   0
California  38332521
Texas       26448193
New York    19651127
Florida     19552860
Illinois    12882135

In [36]:
data=[{"a":i,'b':3*i} for i in range(1,4)]

In [37]:
pd.DataFrame(data)

   a  b
0  1  3
1  2  6
2  3  9

In [38]:
pd.DataFrame(data,index=['a','b','c'],columns=["a"])

   a
a  1
b  2
c  3

In [39]:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

## From a one-dimensional NumPy array.

In [40]:
a=pd.DataFrame(np.arange(1,4),columns=['a'])
a.index.name="1ddf"
print(a)
type(a)

      a
1ddf
0     1
1     2
2     3

pandas.core.frame.DataFrame

## From a two-dimensional NumPy array.

In [41]:
pd.DataFrame(np.random.rand(3, 2),
 columns=['foo', 'bar'],
 index=['a', 'b', 'c'])

        foo       bar
a  0.028836  0.635170
b  0.108035  0.195962
c  0.627022  0.074250

## From a NumPy structured array.

In [42]:
A=np.zeros(3,dtype=[("A",'int64'),('B','float64')])
a=pd.DataFrame(A)
a

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

## The Pandas Index Object

In [43]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [44]:
ind[1]

3

In [45]:
ind[2:4]

Int64Index([5, 7], dtype='int64')

In [46]:
ind[::2]

Int64Index([2, 5, 11], dtype='int64')

In [47]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

In [48]:
ind[1] = 0

TypeError: Index does not support mutable operations

## Index as ordered set

In [49]:
indA = pd.Index([1, 3, 5, 7, 9])

indB = pd.Index([2, 3, 5, 7, 11])

In [50]:
indA|indB #union

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [51]:
indA & indB # intersection

Int64Index([3, 5, 7], dtype='int64')

In [52]:
indA^indB # symmeteric Difference

Int64Index([1, 2, 9, 11], dtype='int64')

## Data Indexing and Selection

### Data Selection in Series

In [54]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
index=['a', "b", 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [55]:
data["a"]

0.25

In [56]:
data[1] # if there any index will be 1 it give expicitly

0.5

In [57]:

"a" in data

True

In [58]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [59]:
data.keys

<bound method Series.keys of a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64>

In [60]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [61]:
data['a':'e']

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [62]:
data[1:4]

b    0.50
c    0.75
d    1.00
dtype: float64

In [63]:
data[(data>0.3) & (data<0.8)]

b    0.50
c    0.75
dtype: float64

In [64]:
data.loc[(data>0.3) & (data<0.8)]

b    0.50
c    0.75
dtype: float64

In [65]:
data[["a",'d']]

a    0.25
d    1.00
dtype: float64

In [66]:
data.loc[["a",'d']]

a    0.25
d    1.00
dtype: float64

In [67]:
data.loc['a']

0.25

In [68]:
data.loc['a':'d']

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [69]:
data.loc[1:2] # loc work on index and give the value of alast index also

TypeError: cannot do slice indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [1] of <class 'int'>

In [70]:
data.iloc[1:2]

b    0.5
dtype: float64

In [71]:
data.iloc[3]

1.0

In [72]:
data.iloc[[1,3]]

b    0.5
d    1.0
dtype: float64

In [73]:
data.iloc[(data>0.3)]

ValueError: iLocation based boolean indexing cannot use an indexable as a mask

###  DataFrame as a dictionary

In [74]:
area = pd.Series({'California': 423967, 'Texas': 695662,
 'New York': 141297, 'Florida': 170312,
 'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
 'New York': 19651127, 'Florida': 19552860,
 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})

data=data.sort_index()

In [75]:
data['area']

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

In [76]:
data['California':]

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135
New York    141297  19651127
Texas       695662  26448193

In [77]:
data[data.area > 170000]

              area       pop
California  423967  38332521
Florida     170312  19552860
Texas       695662  26448193

In [78]:
# cant perform fancy indexing without loc

In [79]:
data.loc['Texas']

area      695662
pop     26448193
Name: Texas, dtype: int64

In [80]:
data.loc['Texas','area']

695662

In [81]:
data.loc['Florida':]

            area       pop
Florida   170312  19552860
Illinois  149995  12882135
New York  141297  19651127
Texas     695662  26448193

In [82]:
data.loc['Florida':,'area']

Florida     170312
Illinois    149995
New York    141297
Texas       695662
Name: area, dtype: int64

In [83]:
data.loc['Florida','area':]

area      170312
pop     19552860
Name: Florida, dtype: int64

In [84]:
data.loc['Florida':,'area':]

            area       pop
Florida   170312  19552860
Illinois  149995  12882135
New York  141297  19651127
Texas     695662  26448193

In [85]:
data.iloc[1]

area      170312
pop     19552860
Name: Florida, dtype: int64

In [86]:
data.iloc[1,1]

19552860

In [87]:
data.iloc[1:]

            area       pop
Florida   170312  19552860
Illinois  149995  12882135
New York  141297  19651127
Texas     695662  26448193

In [88]:
data.iloc[1:,1]

Florida     19552860
Illinois    12882135
New York    19651127
Texas       26448193
Name: pop, dtype: int64

In [89]:
data.iloc[1,:]

area      170312
pop     19552860
Name: Florida, dtype: int64

In [90]:
data.iloc[:2,:2]

              area       pop
California  423967  38332521
Florida     170312  19552860

In [91]:
data.loc[data.area > 170000]

              area       pop
California  423967  38332521
Florida     170312  19552860
Texas       695662  26448193

In [92]:
data.loc[['California','Florida','Texas'], ['pop']]

                 pop
California  38332521
Florida     19552860
Texas       26448193

##  Operating on Data in Pandas

### Ufuncs: Index Preservation

In [93]:
import pandas as pd
import numpy as np

In [94]:
ser = pd.Series(np.random.randint(0, 10, 4))
ser

0    4
1    6
2    2
3    6
dtype: int32

In [95]:
df = pd.DataFrame(np.random.randint(0, 10, (3, 4)),
columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  5  7  8  2
1  7  3  9  1
2  5  1  7  8

In [96]:
np.exp(ser)

0     54.598150
1    403.428793
2      7.389056
3    403.428793
dtype: float64

In [97]:
np.sin(df*np.e)

          A         B         C         D
0  0.854734  0.177472  0.242453 -0.749046
1  0.177472  0.955081 -0.619578  0.410781
2  0.854734  0.410781  0.177472  0.242453

### UFuncs: Index Alignment

In [98]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
 'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
 'New York': 19651127}, name='population')

In [99]:
population/area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [100]:
area.index|population.index # union

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [101]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [102]:
A.add(B,fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

### Index alignment in DataFrame

In [103]:
A = pd.DataFrame(np.random.randint(0, 20, (2, 2)),
 columns=list('AB'))
A

    A  B
0   7  6
1  16  4

In [104]:
B = pd.DataFrame(np.random.randint(0, 10, (3, 3)),
 columns=list('BAC'))
B

   B  A  C
0  7  7  2
1  2  4  2
2  2  4  0

In [105]:
A+B

      A     B   C
0  14.0  13.0 NaN
1  20.0   6.0 NaN
2   NaN   NaN NaN

In [106]:
A.add(B)

      A     B   C
0  14.0  13.0 NaN
1  20.0   6.0 NaN
2   NaN   NaN NaN

In [107]:
A.multiply(B)

      A     B   C
0  49.0  42.0 NaN
1  64.0   8.0 NaN
2   NaN   NaN NaN

In [108]:
A*B

      A     B   C
0  49.0  42.0 NaN
1  64.0   8.0 NaN
2   NaN   NaN NaN

In [109]:
fill=A.stack().mean()
A.multiply(B,fill_value=fill)

      A     B     C
0  49.0  42.0  16.5
1  64.0   8.0  16.5
2  33.0  16.5   0.0

In [110]:
B.multiply(A,fill_value=fill)

      A     B     C
0  49.0  42.0  16.5
1  64.0   8.0  16.5
2  33.0  16.5   0.0

In [111]:
A.multiply(B)

      A     B   C
0  49.0  42.0 NaN
1  64.0   8.0 NaN
2   NaN   NaN NaN

In [112]:
#   + add()
#   - sub(), subtract()
#   * mul(), multiply()
#   / truediv(), div(), divide()
#   // floordiv()
#   % mod()
#   ** pow()

## Ufuncs: Operations Between DataFrame and Series

In [113]:
A =np.random.randint(10, size=(3, 4))
A

array([[7, 2, 2, 5],
       [1, 4, 2, 2],
       [7, 2, 9, 7]])

In [114]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-6,  2,  0, -3],
       [ 0,  0,  7,  2]])

In [115]:
df = pd.DataFrame(A, columns=list('QRST'))
print(df)
df - df.iloc[0]

   Q  R  S  T
0  7  2  2  5
1  1  4  2  2
2  7  2  9  7

   Q  R  S  T
0  0  0  0  0
1 -6  2  0 -3
2  0  0  7  2

In [116]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0  5  0  0  3
1 -3  0 -2 -2
2  5  0  7  5

In [117]:
halfrow = df.iloc[0, ::2]
halfrow

Q    7
S    2
Name: 0, dtype: int32

In [118]:
df-halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -6.0 NaN  0.0 NaN
2  0.0 NaN  7.0 NaN

## Handling Missing Data

### Operating on Null Values

####  isnull() ->Generate a Boolean mask indicating missing values
####  notnull() -> Opposite of isnull()
#### dropna() -> Return a filtered version of the data
#### fillna() -> Return a copy of the data with missing values filled or imputed

In [119]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [120]:
data[data.isnull()]

1     NaN
3    None
dtype: object

In [121]:
data.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [122]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [123]:
data.dropna()

0        1
2    hello
dtype: object

In [124]:
df = pd.DataFrame([[1, np.nan, 2],
 [2, 3, 5],
 [np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [125]:
df.isnull()

       0      1      2
0  False   True  False
1  False  False  False
2   True  False  False

In [126]:
df[df.isnull()]

    0   1   2
0 NaN NaN NaN
1 NaN NaN NaN
2 NaN NaN NaN

In [127]:
df[df.notnull()]

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [128]:
data.dropna()

0        1
2    hello
dtype: object

In [129]:
df = pd.DataFrame([[1, np.nan, 2],[2, 3, 5],[np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [130]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [131]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [132]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [133]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [134]:
df.dropna(axis='columns', how='any')

   2
0  2
1  5
2  6

In [135]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [136]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [137]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [138]:
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [139]:
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [140]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [141]:
df.fillna(method='ffill', axis=0)

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  2.0  4.0  6 NaN

In [142]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [143]:
df.fillna(method='bfill', axis=1)

     0    1    2   3
0  1.0  2.0  2.0 NaN
1  2.0  3.0  5.0 NaN
2  4.0  4.0  6.0 NaN

In [144]:
df.fillna(method='bfill', axis=0)

     0    1  2   3
0  1.0  3.0  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

## Hierarchical Indexing

In [145]:
index = [('California', 2000), ('California', 2010),
 ('New York', 2000), ('New York', 2010),
 ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
 18976457, 19378102,
 20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [146]:
pop[('California', 2010):('Texas', 2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [147]:
index=pd.MultiIndex.from_tuples(index)

In [148]:
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [149]:
pop=pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [150]:
pop[:, (2000)]

California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [151]:
pop[pop > 22000000]

California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [152]:
pop.loc['California':'New York',2000]

California  2000    33871648
New York    2000    18976457
dtype: int64

In [153]:
pop.loc[:,2000]

California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [154]:
pop[['California', 'Texas']]

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

### MultiIndex as extra dimension

In [155]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [156]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [157]:
pop_df = pd.DataFrame({'total': pop,
 'under18': [9267089, 9284094,
 4687374, 4318033,
 5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [158]:
pop_df.unstack()

               total            under18
                2000      2010     2000     2010
California  33871648  37253956  9267089  9284094
New York    18976457  19378102  4687374  4318033
Texas       20851820  25145561  5906301  6879014

In [159]:
f_u18 = pop_df['under18'] / pop_df['total']
print(f_u18)
f_u18.unstack()

California  2000    0.273594
            2010    0.249211
New York    2000    0.247010
            2010    0.222831
Texas       2000    0.283251
            2010    0.273568
dtype: float64

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

## Methods of MultiIndex Creation

In [160]:
df = pd.DataFrame(np.random.rand(4, 2),index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],columns=['data1', 'data2'])
df

        data1     data2
a 1  0.200221  0.021821
  2  0.136787  0.526751
b 1  0.549634  0.823635
  2  0.645127  0.813493

In [161]:
data = {('California', 2000): 33871648,
 ('California', 2010): 37253956,
 ('Texas', 2000): 20851820,
 ('Texas', 2010): 25145561,
 ('New York', 2000): 18976457,
 ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [162]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [163]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [164]:
 pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [165]:
pd.MultiIndex(levels=[['a', 'b'], [1, 2]],
 codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [166]:
pd.MultiIndex.from_frame(pd.DataFrame([['HI', 'Temp'], ['HI', 'Precip'],['NJ', 'Temp'], ['NJ', 'Precip']]))

MultiIndex([('HI',   'Temp'),
            ('HI', 'Precip'),
            ('NJ',   'Temp'),
            ('NJ', 'Precip')],
           names=[0, 1])

### MultiIndex level names

In [167]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

### MultiIndex for columns

In [168]:
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
 names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
 names=['subject', 'type'])
# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37
# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      40.0  37.0  45.0  38.7  25.0  37.4
     2      12.0  36.7  42.0  35.5  49.0  37.6
2014 1      14.0  36.9  28.0  36.6  54.0  37.3
     2      28.0  38.3  55.0  36.6  33.0  36.5

In [169]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      45.0  38.7
     2      42.0  35.5
2014 1      28.0  36.6
     2      55.0  36.6

## Indexing and Slicing a MultiIndex

### Multiply indexed Series

In [170]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [171]:
 pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [172]:
 pop['California', 2000]

33871648

In [173]:
pop['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [174]:
pop[:,2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [175]:
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [176]:
pop[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [177]:
pop.loc['California',2000]

33871648

In [178]:
pop.loc['California':'New York',2000]

state       year
California  2000    33871648
New York    2000    18976457
dtype: int64

In [179]:
pop.loc[pop > 22000000,2000]

state       year
California  2000    33871648
dtype: int64

In [180]:
pop.loc[['California', 'Texas'],2000]

state       year
California  2000    33871648
Texas       2000    20851820
dtype: int64

In [181]:
pop.iloc[1]

37253956

In [182]:
pop.iloc[1:4]

state       year
California  2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [183]:
pop.iloc[[1,2]]

state       year
California  2010    37253956
New York    2000    18976457
dtype: int64

### Multiply indexed DataFrames

In [184]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      40.0  37.0  45.0  38.7  25.0  37.4
     2      12.0  36.7  42.0  35.5  49.0  37.6
2014 1      14.0  36.9  28.0  36.6  54.0  37.3
     2      28.0  38.3  55.0  36.6  33.0  36.5

In [185]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      45.0  38.7
     2      42.0  35.5
2014 1      28.0  36.6
     2      55.0  36.6

In [186]:
health_data['Guido', 'HR']

year  visit
2013  1        45.0
      2        42.0
2014  1        28.0
      2        55.0
Name: (Guido, HR), dtype: float64

In [187]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      40.0  37.0
     2      12.0  36.7

In [188]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        40.0
      2        12.0
2014  1        14.0
      2        28.0
Name: (Bob, HR), dtype: float64

In [189]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      40.0  45.0  25.0
2014 1      14.0  28.0  54.0

## Rearranging Multi-Indices

### Sorted and unsorted indices

In [190]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.835341
      2      0.117137
c     1      0.594734
      2      0.474564
b     1      0.435327
      2      0.746242
dtype: float64

In [191]:
data = data.sort_index()
data

char  int
a     1      0.835341
      2      0.117137
b     1      0.435327
      2      0.746242
c     1      0.594734
      2      0.474564
dtype: float64

In [192]:
data['a':'b']

char  int
a     1      0.835341
      2      0.117137
b     1      0.435327
      2      0.746242
dtype: float64

### Stacking and unstacking indices

In [193]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [194]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [195]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [196]:
pop.unstack(level=0).stack()

year  state
2000  California    33871648
      New York      18976457
      Texas         20851820
2010  California    37253956
      New York      19378102
      Texas         25145561
dtype: int64

### Index setting and resetting

In [197]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [198]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

## Data Aggregations on Multi-Indices

In [199]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      40.0  37.0  45.0  38.7  25.0  37.4
     2      12.0  36.7  42.0  35.5  49.0  37.6
2014 1      14.0  36.9  28.0  36.6  54.0  37.3
     2      28.0  38.3  55.0  36.6  33.0  36.5

In [200]:
data_mean = health_data.mean(level='year')
data_mean

subject   Bob        Guido         Sue
type       HR   Temp    HR  Temp    HR  Temp
year
2013     26.0  36.85  43.5  37.1  37.0  37.5
2014     21.0  37.60  41.5  36.6  43.5  36.9

In [201]:
data_mean = health_data.mean(level='subject',axis=1 )
data_mean

subject       Bob  Guido    Sue
year visit
2013 1      38.50  41.85  31.20
     2      24.35  38.75  43.30
2014 1      25.45  32.30  45.65
     2      33.15  45.80  34.75

In [202]:
data_mean = health_data.mean(level='year')
data_mean.mean(axis=1, level='type')

type         HR       Temp
year
2013  35.500000  37.150000
2014  35.333333  37.033333

## Combining Datasets: Concat and Append

In [39]:
#pd.concat(objs, axis=0, join='outer', join_axes=None, ignore_index=False, keys=None, levels=None, names=None, verify_integrity=False,copy=True)

In [1]:
import numpy as np 
import pandas as pd

In [2]:
data1=pd.DataFrame({"A":['A0',"A1"],"B":['B0','B1'],'C':['C0',"C1"]})
data2=pd.DataFrame({"C":['C0',"C1"],"D":['D0','D1']})
data1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1

In [3]:
data2

    C   D
0  C0  D0
1  C1  D1

In [10]:
print(data1); print(data2)
pd.concat([data1, data2] ,axis=0)

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
    C   D
0  C0  D0
1  C1  D1

     A    B   C    D
0   A0   B0  C0  NaN
1   A1   B1  C1  NaN
0  NaN  NaN  C0   D0
1  NaN  NaN  C1   D1

In [11]:
pd.concat([data1, data2] ,axis=0,ignore_index=True)

     A    B   C    D
0   A0   B0  C0  NaN
1   A1   B1  C1  NaN
2  NaN  NaN  C0   D0
3  NaN  NaN  C1   D1

In [14]:
pd.concat([data1, data2] ,axis=1)

    A   B   C   C   D
0  A0  B0  C0  C0  D0
1  A1  B1  C1  C1  D1

In [22]:
x=pd.DataFrame({'A':['A0','A1'],'B':['B0','B1']})
y=pd.DataFrame({'A':['A2','A3'],'B':['B2','B3']})
print(x)
print(y)

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3

In [26]:
print(pd.concat([x, y], keys=['x', 'y']))

      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

In [38]:
def make_df(cols, ind):
    data = {c: [str(c) + str(i) for i in ind] for c in cols}
    return pd.DataFrame(data, ind)

### Concatenation with joins

In [207]:
merge=pd.concat([data1, data2] ,axis=0,ignore_index=True,join='inner')

In [41]:
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
print(df5); print(df6); print(pd.concat([df5, df6]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [45]:
print(df5,"\n"); print(df6,"\n");
print(pd.concat([df5, df6], join='inner'))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2

    B   C   D
3  B3  C3  D3
4  B4  C4  D4

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [49]:
print(df5); print(df6);
print(pd.concat([df5, df6], join='outer'))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

### The append() method

In [51]:
data1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1

In [52]:
data2

    C   D
0  C0  D0
1  C1  D1

In [56]:
data1.append(data2)

     A    B   C    D
0   A0   B0  C0  NaN
1   A1   B1  C1  NaN
0  NaN  NaN  C0   D0
1  NaN  NaN  C1   D1

## Combining Datasets: Merge and Join

### Relational Algebra

In [61]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
 'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
 'hire_date': [2004, 2008, 2012, 2014]})

In [75]:
# one to one

In [65]:
print(df1);print(df2);

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [66]:
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [76]:
#many to one

In [86]:
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [77]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
 'supervisor': ['Carly', 'Guido', 'Steve']})

In [78]:
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [79]:
pd.merge(df3,df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [80]:
df3.merge(df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [81]:
# many to many

In [82]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting','Engineering', 'Engineering', 'HR', 'HR'],'skills': ['math', 'spreadsheets', 'coding', 'linux',
 'spreadsheets', 'organization']})

In [83]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [84]:
df5

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [85]:
pd.merge(df1, df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [87]:
# one to many

In [88]:
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [89]:
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [91]:
pd.merge(df4,df3)

         group supervisor employee  hire_date
0   Accounting      Carly      Bob       2008
1  Engineering      Guido     Jake       2012
2  Engineering      Guido     Lisa       2004
3           HR      Steve      Sue       2014

## Specification of the Merge Key

### The on keyword

In [93]:
print(df1,'\n');print(df2);

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [97]:
pd.merge(df1, df2, on='employee')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

### The left_on and right_on keywords

In [98]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
 'salary': [70000, 80000, 120000, 90000]})

In [99]:
df3

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [100]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [101]:
print(pd.merge(df1, df3, left_on="employee", right_on="name"))

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [102]:
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

### The left_index and right_index keywords

In [103]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')

In [104]:
df1a

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

In [105]:
df2a

          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [106]:
pd.merge(df1a, df2a, left_index=True, right_index=True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [107]:
print(df1a.join(df2a))

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [108]:
pd.merge(df1a, df3, left_index=True, right_on='name')

         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

### Specifying Set Arithmetic for Joins

In [118]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
 'food': ['fish', 'beans', 'bread']},
 columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
 'drink': ['wine', 'beer']},
 columns=['name', 'drink'])

In [119]:
df6

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

In [120]:
df7

     name drink
0    Mary  wine
1  Joseph  beer

In [121]:
pd.merge(df6, df7)

   name   food drink
0  Mary  bread  wine

In [110]:
pd.merge(df6, df7, how='inner')

   name   food drink
0  Mary  bread  wine

In [112]:
pd.merge(df6, df7, how='outer')

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [114]:
(pd.merge(df6, df7, how='left'))

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [115]:
pd.merge(df6, df7, how='right')

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

### Overlapping Column Names: The suffixes Keyword

In [123]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
 'rank': [1, 2, 3, 4]})
df8

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

In [124]:
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
 'rank': [3, 1, 4, 2]})
df9

   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

In [127]:
pd.merge(df8,df9,on='name')

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [129]:
pd.merge(df8, df9, on="name", suffixes=["_L", "_R"])

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

### Example: US States Data

In [3]:
# Following are shell commands to download the data
#!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv
#!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-areas.csv
#!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-abbrevs.csv

In [6]:
pop = pd.read_csv('state-population.csv')
areas = pd.read_csv('state-areas.csv')
abbrevs = pd.read_csv('state-abbrevs.csv')

In [7]:
pop.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [9]:
areas.head()

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [10]:
abbrevs.head()

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [18]:
merge=pd.merge(pop,abbrevs,how='outer',left_on='state/region',right_on='abbreviation').drop('abbreviation',axis=1)

In [19]:
merge.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [20]:
merge.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [22]:
merge[merge['population'].isnull()].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [24]:
merge.loc[merge['state'].isnull(),'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [27]:
merge.loc[merge['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merge.loc[merge['state/region'] == 'USA', 'state'] = 'United States'

merge.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [30]:
final = pd.merge(merge, areas, on='state', how='left')
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [31]:
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [39]:
final.loc[final['area (sq. mi)'].isnull(),'state'].unique()

array(['United States'], dtype=object)

In [64]:
final.dropna(inplace=True)

In [65]:
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [66]:
data=final[(final['year']==2010) & (final.ages=="total")]

In [67]:
data.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

In [68]:
data.set_index('state', inplace=True)
density = data['population'] / data['area (sq. mi)']

In [69]:
density.tail()

state
Washington         94.557817
West Virginia      76.519582
Wisconsin          86.851900
Wyoming             5.768079
Puerto Rico      1058.665149
dtype: float64

## Aggregation and Grouping

In [70]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [71]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

## Simple Aggregation in Pandas

In [72]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [73]:
ser.sum()

2.811925491708157

In [74]:
ser.mean()

0.5623850983416314

In [75]:
df = pd.DataFrame({'A': rng.rand(5),
 'B': rng.rand(5)})

In [76]:
df

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [77]:
df.mean()

A    0.477888
B    0.443420
dtype: float64

In [78]:
df.mean(axis=1)

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [79]:
df.mean(axis='columns')

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [82]:
planets.isnull().any()

method            False
number            False
orbital_period     True
mass               True
distance           True
year              False
dtype: bool

In [83]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

## Aggregation Description
##### count() --> Total number of items
##### first(), last() --> First and last item
##### mean(), median() --> Mean and median
##### min(), max() --> Minimum and maximum
##### std(), var() --> Standard deviation and variance
##### mad() -->  Mean absolute deviation
##### prod() -->  Product of all items
##### sum() -->  Sum of all items

## GroupBy: Split, Apply, Combine

In [84]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
 'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [87]:
df.groupby('key')

In [90]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

### The GroupBy object

#### Column indexing.

In [91]:
planets.groupby('method')

In [92]:
planets.groupby('method')['orbital_period']

In [93]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [94]:
for (method, group) in planets.groupby('method'):
    print("{0:30s} shape={1}".format(method, group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

In [98]:
planets.groupby('method')['year'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

In [100]:
planets.groupby('method')['year'].describe().stack()

method
Astrometry                 count       2.00000
                           mean     2011.50000
                           std         2.12132
                           min      2010.00000
                           25%      2010.75000
                                       ...
Transit Timing Variations  min      2011.00000
                           25%      2011.75000
                           50%      2012.50000
                           75%      2013.25000
                           max      2014.00000
Length: 79, dtype: float64

### Aggregate, filter, transform, apply

In [102]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],'data1': range(6),'data2': rng.randint(0, 10, 6)},columns = ['key', 'data1', 'data2'])

In [103]:
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

### Aggergation

In [104]:
df.groupby('key').aggregate(['min', np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [105]:
df.groupby('key')['data1'].aggregate(['min', np.median, max])

     min  median  max
key
A      0     1.5    3
B      1     2.5    4
C      2     3.5    5

In [106]:
df.groupby('key').aggregate({'data1': 'min',
 'data2': 'max'})

     data1  data2
key
A        0      5
B        1      7
C        2      9

In [107]:
df.groupby('key').aggregate({'data1': ['min','max','sum'],
 'data2': 'max'})

    data1         data2
      min max sum   max
key
A       0   3   3     5
B       1   4   5     7
C       2   5   7     9

In [108]:
def func(x):
    return x['data2'].std()>4

In [111]:
print(df);

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [112]:
print(df.groupby('key').std());

       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641

In [113]:
print(df.groupby('key').filter(func))

  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

## Transformation.

In [114]:
df.groupby('key').transform(lambda x: x - x.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

## The apply() method.

In [116]:
def norm_by_data2(x):
 # x is a DataFrame of group values
    x['data1'] /= x['data2'].sum()
    return x
print(df.groupby('key').apply(norm_by_data2))

  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9

### Specifying the split key

In [117]:
## A list, array, series, or index providing the grouping keys.

In [118]:
L = [0, 1, 0, 1, 2, 0]
print(df)

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [119]:
print(df.groupby(L).sum())

   data1  data2
0      7     17
1      4      3
2      4      7

In [120]:
print(df.groupby(df['key']).sum())

     data1  data2
key
A        3      8
B        5      7
C        7     12

### A dictionary or series mapping index to group. A

In [124]:
df2 = df.set_index('key')
mapping = {'A': 'vowel', 'B': 'consonant', 'C': 'consonant'}
print(df2);

     data1  data2
key
A        0      5
B        1      0
C        2      3
A        3      3
B        4      7
C        5      9

In [125]:
print(df2.groupby(mapping).sum())

           data1  data2
consonant     12     19
vowel          3      8

In [127]:
df2.groupby(str.lower).sum()

   data1  data2
a      3      8
b      5      7
c      7     12

In [128]:
df2.groupby([str.lower,mapping]).sum()

             data1  data2
a vowel          3      8
b consonant      5      7
c consonant      7     12

### Grouping example

In [132]:
decade = 10 * (planets['year'] // 10)
decade = decade.astype(str) + 's'

In [133]:
decade.head()

0    2000s
1    2000s
2    2010s
3    2000s
4    2000s
Name: year, dtype: object

In [134]:
decade.name = 'decade'

In [141]:
planets.groupby(['method', decade])['number'].sum()

method                         decade
Astrometry                     2010s       2
Eclipse Timing Variations      2000s       5
                               2010s      10
Imaging                        2000s      29
                               2010s      21
Microlensing                   2000s      12
                               2010s      15
Orbital Brightness Modulation  2010s       5
Pulsar Timing                  1990s       9
                               2000s       1
                               2010s       1
Pulsation Timing Variations    2000s       1
Radial Velocity                1980s       1
                               1990s      52
                               2000s     475
                               2010s     424
Transit                        2000s      64
                               2010s     712
Transit Timing Variations      2010s       9
Name: number, dtype: int64

In [142]:
planets.groupby(['method', decade])['number'].sum().unstack()

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       NaN    NaN    NaN    2.0
Eclipse Timing Variations        NaN    NaN    5.0   10.0
Imaging                          NaN    NaN   29.0   21.0
Microlensing                     NaN    NaN   12.0   15.0
Orbital Brightness Modulation    NaN    NaN    NaN    5.0
Pulsar Timing                    NaN    9.0    1.0    1.0
Pulsation Timing Variations      NaN    NaN    1.0    NaN
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          NaN    NaN   64.0  712.0
Transit Timing Variations        NaN    NaN    NaN    9.0

In [143]:
planets.groupby(['method', decade])['number'].sum().unstack().fillna(0)

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0

# Pivot Tables

## Motivating Pivot Tables

In [144]:
import numpy as np
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [145]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True